# StairSetOptTotalRise

## Description
Sets Stair Total Rise Option - not recommended for use

```pascal
FUNCTION StairSetOptTotalRise(
				stair           : HANDLE;
				OptionTotalRise : INTEGER) : BOOLEAN;
```

```python

def vs.StairSetOptTotalRise(stair, OptionTotalRise):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||
|OptionTotalRise|INTEGER||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs